/*
SQLyog Ultimate v8.32 
MySQL - 5.5.49 : Database - db_shop
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`db_shop` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `db_shop`;

/*Table structure for table `t_boy` */

DROP TABLE IF EXISTS `t_boy`;

CREATE TABLE `t_boy` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `boyname` varchar(20) DEFAULT NULL,
  `boydesc` varchar(50) DEFAULT NULL,
  `boypirce` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=168 DEFAULT CHARSET=utf8;

/*Data for the table `t_boy` */

insert  into `t_boy`(`id`,`boyname`,`boydesc`,`boypirce`) values (1,'男装','男装类',100),(2,'xx','xx',100),(3,'xx','xx',100),(7,'女装','女装类',100),(14,'女装','女装类',100),(16,'女装','女装类',100),(17,'女装','女装类',100),(18,'123','123',1231),(19,'女装','女装类',100),(86,'数码','数码类',2000),(87,'数码','数码类',2000),(88,'数码','数码类',2000),(89,'数码','数码类',2000),(90,'数码','数码类',2000),(91,'手机','手机类',3000),(92,'手机','手机类',3000),(93,'手机','华为',3023),(94,'手机','手机类',3000),(95,'手机','手机类',3000),(96,'宠物','宠物类',1458),(97,'宠物','宠物类',1458),(98,'宠物','宠物类',1458),(99,'宠物','宠物类',1458),(100,'宠物','宠物类',1458),(101,'玩具','玩具类',1258),(102,'玩具','玩具类',1448),(103,'玩具','玩具类',1158),(104,'数码','数码类',2000),(105,'数码','数码类',2000),(106,'数码','数码类',2000),(107,'数码','数码类',2000),(108,'数码','数码类',2000),(109,'手机','手机类',3000),(110,'数码','数码类',2000),(111,'数码','数码类',2000),(112,'数码','数码类',2000),(113,'数码','数码类',2000),(114,'数码','数码类',2000),(115,'手机','手机类',3000),(116,'手机','手机类',3000),(117,'手机','手机类',3000),(118,'手机','手机类',3000),(119,'手机','手机类',3000),(120,'宠物','宠物类',1458),(121,'宠物','宠物类',1458),(122,'宠物','宠物类',1458),(123,'宠物','宠物类',1458),(124,'宠物','宠物类',1458),(125,'玩具','玩具类',1258),(126,'玩具','玩具类',1448),(127,'玩具','玩具类',1158),(128,'玩具','玩具类',1238),(129,'玩具','玩具类',1118),(130,'手机','手机类',3000),(131,'手机','手机类',3000),(132,'手机','手机类',3000),(133,'手机','手机类',3000),(134,'宠物','宠物类',1458),(135,'宠物','宠物类',1458),(136,'数码','数码类',2000),(137,'数码','数码类',2000),(138,'数码','数码类',2000),(139,'数码','数码类',2000),(140,'数码','数码类',2000),(141,'手机','手机类',3000),(142,'手机','手机类',3000),(143,'手机','手机类',3000),(144,'手机','手机类',3000),(145,'手机','手机类',3000),(146,'宠物','宠物类',1458),(147,'宠物','宠物类',1458),(148,'宠物','宠物类',1458),(149,'宠物','宠物类',1458),(150,'宠物','宠物类',1458),(151,'玩具','玩具类',1258),(152,'玩具','玩具类',1448),(153,'玩具','玩具类',1158),(154,'玩具','玩具类',1238),(155,'玩具','玩具类',1118),(156,'宠物','宠物类',1458),(157,'宠物','宠物类',1458),(158,'宠物','宠物类',1458),(159,'玩具','玩具类',1258),(160,'玩具','玩具类',1448),(161,'玩具','玩具类',1158),(162,'玩具','玩具类',1238),(163,'玩具','玩具类',1118),(164,'玩具','玩具类',1238),(165,'玩具','玩具类',1118),(167,'123','asdmin',100123);

/*Table structure for table `t_user` */

DROP TABLE IF EXISTS `t_user`;

CREATE TABLE `t_user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userName` varchar(20) DEFAULT NULL,
  `password` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

/*Data for the table `t_user` */

insert  into `t_user`(`id`,`userName`,`password`) values (1,'lz','123'),(2,'yyx','321'),(3,'zxl','132'),(4,'wds','312');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
